spec/vcr/VAT/Seller_in_EU_country_Buyer_in_another_EU_country/Seller_has_Nexus_Jurisdition_Registered/destination_country_tax_is_returned.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R349329539","DocDate":"2017-04-17","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #21 - 4825","TaxCode":"PC030000","ItemCode":"SKU-21","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R349329539","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1133'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Mon, 17 Apr 2017 21:20:18 GMT
      Content-Length:
      - '667'
      Set-Cookie:
      - TS017f1821=01a8ddc44ecce3fe82ee7cdc8c343490400e667935b02f8a684bfe6073020bd55d1b4b592eb88148d88525eff5dc0d96cb5ebf8e78;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++urf/8N7ew/v3HuoXT7OWv9jb2X2wvbO/vfsAX7wpFnnTZotV+NWb
        vd1HezuPdg/GBw8+3Xmw++CnuHHVZuXxolovW26+P35wYD9/WjRT882O/fT0
        Xb5YtUW1DD9+k73LJqXgE0ChL/Dh/fHerv/ZSVZO1yWNYBZ8m717Xizzhj77
        XkJ0wR8vKvrro93t52fawhDk5cnOvR169ONsUpRFe41v2nqd49MnhP4sq6+f
        55d5iS9+qljdxxf9QfQHC4gyoN1Px/f38Nkrwhcf7BC61LFph4/ujfeF/IRf
        MDTvi6d5mxWlHdwJ+qsZ4RfP0eRVfqEoyd/fWddF8+Z6xX2a1uZzQwVpStC/
        DrYM6UW24HYvTt98+/TV8+MXT1/jO2pqvnndZqDjLGWQvyT5fvJLkhGNwE3P
        3vazV/qSQezZK+qTHv34Z296DsZ7n+IjRo7+jox3d/xgX/8MZ8f74oczO++B
        LAMyU/B+k/P9RNocz2Y1aRInUPqBQe8pqQqAM+jTRxZjGe8Zk2lv5/7OQ9Y7
        jJR5XdoqTHxw8DB9UeTrq3w5K376Lb480Tk/XjRtXs+yBT58WZGGKg2U3Z3d
        vfSLE0IdPKXQ7Jdo76F39gYfxNBjEgboSVsFiA/u7adPqvqiSmf5RVmkx+Wk
        +EGBNgbLZ2VV58spc2eIJLrYIRQNZSPK95ck/w8m7JQOygUAAA==
    http_version: 
  recorded_at: Mon, 17 Apr 2017 21:20:18 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R349329539","DocDate":"2017-04-17","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"89
        Nieuwendijk","Line2":"","City":"Amsterdam","Region":"","Country":"NL","PostalCode":"1012
        MC"},{"AddressCode":"1","Line1":"34 Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"20500","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #21 - 4825","TaxCode":"PC030000","ItemCode":"SKU-21","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"2-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R349329539","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1133'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private
      Content-Type:
      - text/json; charset=utf-8
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Mon, 17 Apr 2017 21:20:18 GMT
      Content-Length:
      - '667'
      Set-Cookie:
      - TS017f1821=01a8ddc44e8e5ac9fb16aff4a36b87b94616bd68d5e492afe5600e0879bf2ed0ac989446e6ed0b547112d90410af1af4b858dded8f;
        Path=/
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3m
        kuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZk
        AWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj5
        6Gk1NZ++urf/8N7ew/v3HuoXT7OWv9jb2X2wvbO/vfsAX7wpFnnTZotV+NWb
        vd1HezuPdh+O7+8e7O48/PSnuHHVZuXxolovW26+P35wYD9/WjRT882O/fT0
        Xb5YtUW1DD9+k73LJqXgE0ChL/Dh/fHerv/ZSVZO1yWNYBZ8m717Xizzhj77
        XkJ0wR8vKvrro93t52fawhDk5cnOvR169ONsUpRFe41v2nqd49MnhP4sq6+f
        55d5iS9+qljdxxf9QfQHC4gyoN1Px/f38Nkrwhcf7BC61LFph4/ujfeF/IRf
        MDTvi6d5mxWlHdwJ+qsZ4RfP0eRVfqEoyd/fWddF8+Z6xX2a1uZzQwVpStC/
        DrYM6UW24HYvTt98+/TV8+MXT1/jO2pqvnndZqDjLGWQvyT5fvJLkhGNwE3P
        3vazV/qSQezZK+qTHv34Z296DsZ7n+IjRo7+jox3d/xgX/8MZ8f74oczO++B
        LAMyU/B+k/P9RNocz2Y1aRInUPqBQe8pqQqAM+jTRxZjGe8Zk2lv5/7OQ9Y7
        jJR5XdoqTHxw8DB9UeTrq3w5K376Lb480Tk/XjRtXs+yBT58WZGGKg2U3Z3d
        vfSLE0IdPKXQ7Jdo76F39gYfxNBjEgboSVsFiA/u7adPqvqiSmf5RVmkx+Wk
        +EGBNgbLZ2VV58spc2eIJLrYIRQNZSPK95ck/w8LM6cTygUAAA==
    http_version: 
  recorded_at: Mon, 17 Apr 2017 21:20:19 GMT
recorded_with: VCR 3.0.3
