spec/vcr/VAT/Seller_in_EU_country_Buyer_in_same_EU_country/tax_detail_country_equals_to_IT.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R636593019","DocDate":"2019-01-24","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","Country":"IT","PostalCode":"50122"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"50122","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #2 - 6250","TaxCode":"PC030000","ItemCode":"SKU-2","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R636593019","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1135'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 23 Jan 2019 18:40:08 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '612'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b19fPGmWORNmy1WwVf33uwePNrfebS7N9679+DBzqe7P8WNqzYrjxfVetly8/3x/Yf286dFMzXf7NhPT9/li1VbVMvw4zfZu2xSCj4BFPoCH94fC3b60UlWTtclDWDmf5m9i4+JBmtI8OrTe5/ef3iPvsYX9MbzYpk39M33EiIX/nhR0V8f7W4/P9MW5tWXJzv3dujRj7NJURbtNb5p63WOT5/QcGdZff08v8xLfPFTxeo+vugPuk8cQBQC7H46vsfovdLR7Iz39qhj0w4f3Rt/qn+FpHCfP83brCjt0E7QW83onr1Bk1f5hSIkf39nXRfNm+sV92ham88NDaQpQf8auDKgF9mCm529OX7+++BTamM+e91mIN8sZVi/JPl+8kuSEaHuz8qzV/qSwejZK+qMHv34Z29WDsZ7+IRxoz8j49wdH+hf4Zy4z384c3JrTBmMof5tZ+T7ibQ5ns1qUiZOePQD+vOje/vpk6q+qNJZflEW6XE5KX5QALa2Mag/JVWDj090yp6VVZ0vpzxtZrj0sYzwZUV6qTSv3t/Z3eNhEipCtjMm9t7O/Z2HPFYenWlOIISZFAN8dlssd/HZDwlFUPj/AQd0Dy+4BQAA
    http_version: 
  recorded_at: Wed, 23 Jan 2019 18:40:07 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R636593019","DocDate":"2019-01-24","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","Country":"IT","PostalCode":"50122"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"50122","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #2 - 6250","TaxCode":"PC030000","ItemCode":"SKU-2","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R636593019","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1135'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 23 Jan 2019 18:40:11 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '640'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tHTanpSzfKPHqUfvfr03qf3H97b2X340Yi/eJq1/MUefbS9s7u9t48v3hSLvGmzxSr46t6b3YNH+zuPdvbH+zv3HtzfO/gpbly1WXm8qNbLlpvvj+8zdP78adFMzTc79tPTd/li1RbVMvz4TfYum5SCTwCFvsCH98eCnX50kpXTdUkDmPlfZu8GxpS9e14s84a++V5CVMEfLyr666Pd7edn2sLQ6eXJzr0devTjbFKURXuNb9p6nePTJzSqWVZfP88v8xJf/FSxuo8vuLkMYvfT8T0exCvFaGe8t0dQDVh8dG/8Kf7q04mQCcanDSOkoxHnbVaUdmj0yddA4VV+oWDP3uDvE+BT86Dlg++s66J5c71iOOZb8/mLbMGfn705fv772E8NPQUA9WeavW4zkG+WMl6/JPl+8kuSEaHuz8qzV/qSgfLsFSFOj378PrPSJ1uM4oZqB+M9fMK40Z8Rmu2OD/SvcJbc5505MfSiNkKMLrmZXkPUNRSQpgT9vTFlMIb6dpKojfksNiPfT6TN8WxW503jhEc/oD8/urefPqnqiyqd5RdlkR6Xk+IHBWBrG4P6U9Io+PhEp+xZWdX5csrTZoZLH8sIX1akfkrz6v2d3T0eJqEiZDtjYu/t3N95yGPl0ZnmBEKYSTHAZ7fFchef/ZBQZOq+ypt12ZrPX6+nU8Lmo1+S/D9wYNqduAUAAA==
    http_version: 
  recorded_at: Wed, 23 Jan 2019 18:40:09 GMT
recorded_with: VCR 4.0.0
