spec/vcr/VAT/Seller_in_EU_country_Buyer_is_outside_EU/Seller_has_Nexus_Jurisdiction_Registered/TotalTax_is_equal_to_order_included_tax_total.yml

---
http_interactions:
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R438665134","DocDate":"2019-01-28","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"50122","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 2846","TaxCode":"PC030000","ItemCode":"SKU-18","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R438665134","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1141'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 28 Jan 2019 07:30:13 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '674'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b0DfPGmWORNmy1W4Vdvdh48urfzaOfheHd35+DTnfs/xY2rNiuPF9V62XLzg/HBvv38adFMzTc79tPTd/li1RbVMvz4TfYum5SCTwCFvsCHu+Pd+/5nJ1k5XZc0glnwbfYuPioariHCq/17B59+en/3nvSRvXteLPOGvvleQgTDHy8q+uuj3e3nZ9rCvPryZOfeDj36cTYpyqK9xjdtvc7x6RMa8Cyrr5/nl3mJL45ns1pJ3h95n0IAKlTYfTje28Nnr3RAO+OdferbtJOPHjzQP0N6eF88zdusKO34TtBfzTh/9RpNXuUXitLxc/z9nXVdNG+uV9zn65Yg2k8NGXZ28RHB/jq4MqQX2YLbHT8/fnL8xTE+p2bu0/T1m+M3p+mb49/7o1+SfD/5JcmIUPen5tkrfcfg9OwVdUePfvyzOjUPx5/ePNp7zHf0Z3dm7Bc/jJl5D1QZkJuCW07M9xNposR0gqQf0J8fPdy9n75Ov5NN3zbVMn3dAqp+bRB/SjoHH5/opH1RLduLapETPfBplzQvK1JRpXn53qe7OyzMXYoRXvLRGdN+b+f+3oOHD/END9a8v0Mqbff+LsginKbI4bt7++mTqr6o0ll+URbpcTkpflAAgrYxMJjwBvtnZVXnyynPj4f72Rt8EOJ+f2dXRKeP685DnqYAVQIBmv+S5P8BZUT7dtwFAAA=
    http_version: 
  recorded_at: Mon, 28 Jan 2019 07:30:12 GMT
- request:
    method: post
    uri: https://development.avalara.net/1.0/tax/get
    body:
      encoding: UTF-8
      string: '{"DocCode":"R438665134","DocDate":"2019-01-28","Discount":"0.0","Commit":false,"DocType":"SalesOrder","Addresses":[{"AddressCode":"Orig","Line1":"34
        Borgo degli Albizi","Line2":"","City":"Florence","Region":"","PostalCode":"50122","Country":"IT"},{"AddressCode":"Dest","Line1":"915
        S Jackson St","Line2":"","City":"Montgomery","Region":"Alabama","Country":"US","PostalCode":"36104"},{"AddressCode":"1","Line1":"34
        Borgo degli Albizi","Line2":null,"City":"Florence","PostalCode":"50122","Country":"IT"}],"Lines":[{"LineNo":"1-LI","Description":"Product
        #18 - 2846","TaxCode":"PC030000","ItemCode":"SKU-18","Qty":1,"Amount":19.99,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Discounted":false,"TaxIncluded":true},{"LineNo":"1-FR","ItemCode":"Avalara
        Ground","Qty":1,"Amount":10.0,"OriginCode":"1","DestinationCode":"Dest","CustomerUsageType":null,"Description":"Shipping
        Charge","TaxCode":"FR000000","Discounted":false,"TaxIncluded":true}],"CustomerCode":1,"CompanyCode":"54321","CustomerUsageType":null,"ExemptionNo":null,"Client":"a0o33000004FH8l","ReferenceCode":"R438665134","DetailLevel":"Tax","CurrencyCode":"USD"}'
    headers:
      Accept:
      - "*/*"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - rest-client/2.0.2 (darwin16.7.0 x86_64) ruby/2.5.1p57
      Authorization:
      - Basic MTEwMDExMzA5NjoxRDEzRURBMkRDQ0M3RTRB
      Content-Type:
      - application/json
      Content-Length:
      - '1141'
      Host:
      - development.avalara.net
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Mon, 28 Jan 2019 07:30:16 GMT
      Content-Type:
      - text/json; charset=utf-8
      Content-Length:
      - '677'
      Connection:
      - keep-alive
      Cache-Control:
      - private
      Content-Encoding:
      - gzip
      Vary:
      - Accept-Encoding
      Server:
      - Microsoft-IIS/8.5
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
    body:
      encoding: ASCII-8BIT
      string: !binary |-
        H4sIAAAAAAAEAO29B2AcSZYlJi9tynt/SvVK1+B0oQiAYBMk2JBAEOzBiM3mkuwdaUcjKasqgcplVmVdZhZAzO2dvPfee++999577733ujudTif33/8/XGZkAWz2zkrayZ4hgKrIHz9+fB8/In5x8tGrvFmX7Uk1yz96lH70ej2d5k3z0Sj56Gk1fZq1/Onezu7D7Z3d7b0DfPGmWORNmy1W4Vdvdh48urfzaHdv/Omn9z59+ODhT3Hjqs3K40W1Xrbc/GB8sG8/f1o0U/PNjv309F2+WLVFtQw/fpO9yyal4BNAoS/w4e54977/2UlWTtcljWAWfJu9i4+KhmuI8Gr/3sGnn97fvSd9ZO+eF8u8oW++lxDB8MeLiv76aHf7+Zm2MK++PNm5t0OPfpxNirJor/FNW69zfPqEBjzL6uvn+WVe4ovj2axWkvdH3qcQgAoVdh+O9/bw2Ssd0M54Z5/6Nu3kowcP9M+QHt4XT/M2K0o7vhP0VzPOX71Gk1f5haJ0/Bx/f2ddF82b6xX3+boliPZTQ4adXXxEsL8OrgzpRbbgdsfPj58cf3GMz6mZ+zR9/eb4zWn65vj3/uiXJN9PfkkyItT9qXn2St8xOD17Rd3Rox//rE7Nw/GnN4/2HvMd/dmdGfvFD2Nm3gNVBuSm4JYT8/1EmigxnSDpB/TnRw9376ev0+9k07dNtUxft4CqXxvEn5LOwccnOmlfVMv2olrkRA982iXNy4pUVGlevvfp7o4RZiHaGdN6b+f+3oOHD/END86039nd3dm9v6tkkDfwOZFZOE2Rw2f39tMnVX1RpbP8oizS43JS/KDAa9rGwGTCG+yflVWdL6c8Px7uZ2/wQYj7/Z1dEZ0+7jsPGb8AdQIBmv+S5P8BGDZPTtwFAAA=
    http_version: 
  recorded_at: Mon, 28 Jan 2019 07:30:15 GMT
recorded_with: VCR 4.0.0
